case_interPhaseChangeFoam_waxman_turb_35bar/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          75;
        startFace       56165;
    }
    outlet
    {
        type            patch;
        nFaces          75;
        startFace       56240;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          820;
        startFace       56315;
    }
    side1
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          28500;
        startFace       57135;
    }
    side2
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          28500;
        startFace       85635;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       114135;
    }
)

// ************************************************************************* //
