case_interPhaseChangeFoam_waxman_turb_35bar/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interPhaseChangeFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime; //used to be endTime, writeNow for emergency stop

endTime         30e-3;//was 3ms

deltaT          1e-12;

writeControl    adjustableRunTime;

writeInterval   1e-4;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

runTimeModifiable yes;

adjustTimeStep  on;

maxCo           1; 

maxAlphaCo      1;

//LP: perhaps use eddie's custom restriction block in matlab to predict the maximum velocity, and find what our mesh size should be for ideal courant number from that?


// ************************************************************************* //
